{"0":{"source":"https://api.slack.com/changelog","text":"APIs Apps created after February 24, 2021 will no longer be able to send token as a query parameter. All existing apps require no changes. Learn more.\nhttps://api.slack.com/changelog/2020-11-no-more-tokens-in-querystrings-for-newly-created-apps"},"1":{"source":"https://api.slack.com/changelog","text":"APIs Apps will now be able to unfurl links anywhere in Slack. Learn more.\nhttps://api.slack.com/changelog/2020-11-app-unfurls-everywhere"},"2":{"source":"https://api.slack.com/changelog","text":"APIs We are deprecating all channels.*, groups.*, im.*, and mpim.* Web API methods in favor of their Conversations API replacements. Migrate to conversations.* as soon as possible, as these deprecated methods will retire on February 24, 2021. Read on.\nhttps://api.slack.com/methods#channels"},"3":{"source":"https://api.slack.com/changelog","text":"APIs Three deprecations take effect today, February 24. First, new apps may no longer pass tokens as query parameters. Second, Conversations API methods are now required over their typed counterparts: channel.*, group.*, im.*, and mpim.*. Third, event payloads no longer contain full lists of authed_users or authed_teams—instead, use a new method to learn the full list of authorizations an event is visible to. We know keeping up with best practices for Slack apps is a lot to handle—thank you for allowing us to make the platform better. Keep reading.\nhttps://api.slack.com/changelog/2021-02-24-how-we-broke-your-slack-app"},"4":{"source":"https://api.slack.com/changelog","text":"APIs Beginning June 10th, 2020, all newly created Slack apps will be unable to use the deprecated methods in channels.*, im.*, mpim.*, and groups.*. Existing apps have until February 24th, 2021 to migrate to the Conversations API. Learn more.\nhttps://api.slack.com/docs/conversations-api"},"5":{"source":"https://api.slack.com/changelog","text":"APIs Newly created private channel IDs now always begin with the letter C, just like public channel IDs already do. The Conversations API will tell you whether a conversation is private or not with the is_private boolean field.\nhttps://api.slack.com/docs/conversations-api"},"6":{"source":"https://api.slack.com/changelog","text":"APIs Legacy workspace apps, deprecated since October 2018, will retire on August 24, 2021. Learn if and how this may impact your apps.\nhttps://api.slack.com/changelog/2021-03-workspace-apps-to-retire-in-august-2021"}}